
  {
    "status": 200,
    "articles": [
      {
        "author": {
          "name": "MICHAEL BRANDON INGRAM",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Genshin Impact Leak Hints at 3.8 Second Half Four-Stars",
        "subTitle": "A recent leak from Genshin Impact's Version 3.8 reveals the four-star characters set to join Wanderer and Kokomi during the update's second half.",
        "article": [
          "Before <strong><em>Genshin Impact</em></strong>'s Version 3.8 update has officially launched, leaks are already hinting at the lineup of four-star characters set to feature on the new patch's second half banners. Since the launch of <a href='https://gamerant.com/genshin-impact-hoyoverse-revenue-2022/'>the massively successful HoYoverse RPG</a> in late 2020, the game's roster has more than tripled in size with nearly 70 playable characters available as of Version 3.7's launch. With new characters added almost every patch, the roster has continued to grow with more members adding unique playstyles. Version 3.8, however, is set to buck a longstanding trend for the RPG.",
          "With the Version 3.8 Special Program for <a href='https://gamerant.com/tag/genshin-impact/'><em>Genshin Impact</em></a> airing late last week, HoYoverse would confirm a major break from the norm for the final Sumeru update. Version 3.8 was confirmed to only feature re-runs of past characters with no new members added for the first time in the game's history. While the roster will not welcome any new additions, several popular characters including Klee, Sangonomiya Kokomi, and Wanderer were confirmed for re-runs during the update. Now, new leaks have hinted at the four-star banner characters for Version 3.8's second half.",
          "An update shared by <em>Genshin Impact</em> leaker Genshin Universe revealed the four-star characters set to join Wanderer and Kokomi during the second banners of Version 3.8. Version 3.8's second half is set to feature four-stars from three different nations with Sumeru four-star Faruzan, Liyue four-star Yanfei, and Mondstadt four-star Rosaria. The featured four-star character lineup is nearly identical to Wanderer's initial release in Version 3.3, only swapping Gorou out for Rosaria. Wanderer and Kokomi's banners are expected to debut in late July, three weeks after Version 3.8's launch.",
          "<h2>Genshin Impact Version 3.8 Second Half Banner Characters</h2><ul> <li> Wanderer: five-star Anemo Catalyst character </li> <li> Kokomi: five-star Hydro Catalyst character </li> <li> Faruzan: four-star Anemo Catalyst character </li> <li> Yanfei: four-star Pyro Catalyst character </li> <li> Rosaria: four-star Cryo Polearm character </li> </ul>",
          "The featured characters, as is typical for <em>Genshin Impact</em>'s banners, boast exceptional synergy with the limited five-star characters available. Faruzan has often been a staple of team compositions built around Wanderer, providing powerful Anemo Res shredding effects and boosting allies' Anemo damage. When fully built, Rosaria can also provide powerful buffs for Physical damage-focused characters like Eula, with her 4th Ascension Passive buffing allies' Crit Rate and her C6 passive adding Physical Res shred to her Elemental Burst.",
          "While Version 3.8 is not set to feature any new playable characters, the update will bring plenty of new content to close out <em>Genshin Impact</em>'s Sumeru cycle. The new version will see players whisked away to a new limited-time region with several new mini-games and sub-events. Two of Genshin Impact's oldest characters will also be receiving skins as part of the new update with both Klee and Kaeya sporting new looks for the event. HoYoverse is set to finish the Sumeru region's patch cycle with a bang as the developer prepares for the upcoming addition of Fontaine."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/genshin-impact-version-3-8-banner-leaks-wanderer-kokomi.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 100,
        "images" : [
          "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/genshin-impact-3-8-second-banner-four-stars-faruzan-yanfei-rosaria.jpg?q=50&fit=crop&w=1500&dpr=1.5"
        ],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "genshin impact"
          },
          {
            "name": "mihoyo"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps4"
          },
          {
            "name": "ps5"
          },
          {
            "name": "mobile gaming"
          },
          {
            "name": "android"
          },
          {
            "name": "ios"
          },
          {
            "name": "playstation"
          }
        ]
      },
      {
        "author": {
          "name": "BRUNA TELLES",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Honkai: Star Rail Leaks Jingliu Gameplay",
        "subTitle": "A new video from Honkai: Star Rail shows Jingliu gameplay, one of the most iconic and long-awaited characters in HoYoverse's RPG.",
        "acticle": [
          "A new video for <strong><em>Honkai: Star Rail</em></strong> shows Jingliu's gameplay, giving players an idea of what the upcoming character will look like on the battlefield. <a href='https://gamerant.com/tag/honkai-star-rail/'><em>Honkai: Star Rail</em></a> is still new compared to its <em>Honkai Impact 3rd</em> and <em>Genshin Impact</em>, but HoYoverse's title has followed the same successful path as its 'big brothers,' mainly thanks to its cast of characters.",
          "Honkai: Star Rail currently has 22 playable characters, or 24 if one counts the Trailblazer versions. This list keeps expanding. Since it's a gacha RPG, HoYoverse regularly brings new characters to <em>Honkai: Star Rail</em>. One example is the trio Kafka, Blade, and Luka, who have already been officially announced and should appear in version 1.2 of the game. Meanwhile, <em>Honkai: Star Rail</em>'s leaks bring new information about potential characters almost every day.",
          "Reddit user Administrative_Ad432 shared a video revealing the gameplay for Jingliu, one of the most anticipated characters for <em>Honkai: Star Rail</em> players. Although not officially announced, Jingliu is coming to Honkai: Star Rail, with several leaks bringing information about the 5-star character. The <a href='https://www.reddit.com/r/HonkaiStarRail_leaks/comments/14jcgth/jingliu_gameplay_ult_unfinished/'>nearly three-minute video shared by Administrative_Ad432</a> shows Jingliu in her two versions, the first where the character wears a blindfold and uses her basic attack and skill version along with her standby stance. Jingliu's face becomes fully visible when she enters the Transcendence state and removes the blindfold.",
          "In addition to assuming a new standby stance, Jingliu in the Transcendence state has a skill that consumes two stacks instead of one, gaining a flashier animation than before. The video also shows Jingliu's ultimate, and while players cannot see a complete animation, it is possible to get a general sense of what it will look like. While battling alongside the new <em>Honkai: Star Rail</em> character Luocha, the video emphasizes that Jingliu is still heavily under development, so most of her animations and abilities are broken or unfinished.",
          "The Jingliu gameplay leak has made <em>Honkai: Star Rail</em> players even more eager for the character. Jingliu is a powerful character with an important history in the game's universe, having been Jing Yuan's mentor when he first started joining the ranks of the Cloud Knights. Jingliu will be voiced by actress AmaLee, known for her work in anime such as <em>My Dress-Up Darling</em> and <em>Cardcaptor Sakura: Clear Card</em>."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/honkai-star-rail-video-jingliu-gameplay.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 160,
        "images" : [
          "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/honkai-star-rail-leaks-jinglius-character-kit.jpeg"
        ],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "honkai: star rail"
          },
          {
            "name": "mihoyo"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "android"
          },
          {
            "name": "ios"
          }
        ]
      },
      {
        "author": {
          "name": "DALTON COOPER",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Rockstar Could Have a New Game in Development Besides Grand Theft Auto 6",
        "subTitle": "It seems that Rockstar Games could very well have a brand-new game in development besides the previously announced Grand Theft Auto 6.",
        "acticle": [
          "<em>Grand Theft Auto</em> and <em>Red Dead Redemption 2</em> developer <strong>Rockstar Games</strong> may have a new game in the works that's not <em>Grand Theft Auto 6</em>. The last brand-new project released by Rockstar Games was 2018's landmark release <em>Red Dead Redemption 2</em>, which earned rave reviews from critics, smashed sales records, and won numerous awards. Considering this, it's no surprise that many fans are eagerly anticipating the next game from the studio.",
          "Rockstar's next project is <em>Grand Theft Auto 6</em>, which is currently expected to arrive at some point in 2024 or 2025. Rockstar hasn't shared much in the way of official details about <em>Grand Theft Auto 6</em>, but a massive leak has suggested that the new game will be set in Vice City and will feature two protagonists. While fans wait patiently for news on <em>Grand Theft Auto 6</em>, it seems that they may have another project to look forward to as well.",
          "Voice Actor Michael Ursu's resume has suggested that he is working on an undisclosed Rockstar game, but it stops short of providing any additional details beyond that it is a virtual reality project. It's anyone's guess as to what this virtual reality project could be. It's possible that <a href='https://gamerant.com/tag/rockstar-games/'>Rockstar Games</a> is looking to adapt one of its big IP into the VR space, but it's also possible that it's a completely original project.",
          "One possibility that comes to mind is the <em>Grand Theft Auto: San Andreas</em> VR port that was announced for Meta Quest. Fans have yet to see the <em>San Andreas</em> VR port in action, but it's not expected to add any new content that would necessarily require new voice lines to be recorded. Then again, fans don't really know the full scope of the <em>San Andreas</em> VR game since there haven't been any updates since its initial announcement. It's also worth pointing out that the <em>San Andreas</em> VR port is primarily being developed by Video Games Deluxe, the studio that handled <em>L.A. Noire: The VR Case Files</em>.",
          "For the uninitiated, <em>L.A. Noire: The VR Case Files</em> took some of the cases from the base <em>L.A. Noire</em> game and translated them to a virtual reality space. This venture was largely successful, with <em>L.A. Noire: The VR Case Files</em> earning mostly positive reviews from critics. It's possible a similar approach will be taken when it comes to <em>San Andreas</em> VR, but that remains to be seen.",
          "Regardless, it seems Rockstar fans have another new game to look forward to beyond the long-awaited <em>Grand Theft Auto 6</em>. Whether that's something brand-new as the resume seems to suggest or the previously-announced <em>San Andreas</em> VR port is up for debate."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/rockstar-games-logo-red.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 360,
        "images" : [
          "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2022/09/Rockstar_Games_Logo_orange.jpg?q=50&fit=crop&w=1500&dpr=1.5"
        ],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "rockstar games"
          }
        ]
      },
      {
        "author": {
          "name": "JOSHUA DUCKWORTH",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Final Fantasy 16 Motion Blur is Making People Sick",
        "subTitle": "Various reports indicate that Final Fantasy 16's motion blur feature, which cannot be turned off in the game settings, is making players sick.",
        "acticle": [
          "<em>Grand Theft Auto</em> and <em>Red Dead Redemption 2</em> developer <strong>Rockstar Games</strong> may have a new game in the works that's not <em>Grand Theft Auto 6</em>. The last brand-new project released by Rockstar Games was 2018's landmark release <em>Red Dead Redemption 2</em>, which earned rave reviews from critics, smashed sales records, and won numerous awards. Considering this, it's no surprise that many fans are eagerly anticipating the next game from the studio.",
          "Rockstar's next project is <em>Grand Theft Auto 6</em>, which is currently expected to arrive at some point in 2024 or 2025. Rockstar hasn't shared much in the way of official details about <em>Grand Theft Auto 6</em>, but a massive leak has suggested that the new game will be set in Vice City and will feature two protagonists. While fans wait patiently for news on <em>Grand Theft Auto 6</em>, it seems that they may have another project to look forward to as well.",
          "Voice Actor Michael Ursu's resume has suggested that he is working on an undisclosed Rockstar game, but it stops short of providing any additional details beyond that it is a virtual reality project. It's anyone's guess as to what this virtual reality project could be. It's possible that <a href='https://gamerant.com/tag/rockstar-games/'>Rockstar Games</a> is looking to adapt one of its big IP into the VR space, but it's also possible that it's a completely original project.",
          "One possibility that comes to mind is the <em>Grand Theft Auto: San Andreas</em> VR port that was announced for Meta Quest. Fans have yet to see the <em>San Andreas</em> VR port in action, but it's not expected to add any new content that would necessarily require new voice lines to be recorded. Then again, fans don't really know the full scope of the <em>San Andreas</em> VR game since there haven't been any updates since its initial announcement. It's also worth pointing out that the <em>San Andreas</em> VR port is primarily being developed by Video Games Deluxe, the studio that handled <em>L.A. Noire: The VR Case Files</em>.",
          "For the uninitiated, <em>L.A. Noire: The VR Case Files</em> took some of the cases from the base <em>L.A. Noire</em> game and translated them to a virtual reality space. This venture was largely successful, with <em>L.A. Noire: The VR Case Files</em> earning mostly positive reviews from critics. It's possible a similar approach will be taken when it comes to <em>San Andreas</em> VR, but that remains to be seen.",
          "Regardless, it seems Rockstar fans have another new game to look forward to beyond the long-awaited <em>Grand Theft Auto 6</em>. Whether that's something brand-new as the resume seems to suggest or the previously-announced <em>San Andreas</em> VR port is up for debate."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/ff16-motion-blur.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "images" : [],
        "externalData":"<iframe id='twitter-widget-0' scrolling='no' frameborder='0' allowtransparency='true' allowfullscreen='true' class='' style='position: static; visibility: visible; width: 550px; height: 321px; display: block; flex-grow: 1;' title='Twitter Tweet' src='https://platform.twitter.com/embed/Tweet.html?dnt=false&amp;embedId=twitter-widget-0&amp;features=eyJ0ZndfdGltZWxpbmVfbGlzdCI6eyJidWNrZXQiOltdLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X2ZvbGxvd2VyX2NvdW50X3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9iYWNrZW5kIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19yZWZzcmNfc2Vzc2lvbiI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfZm9zbnJfc29mdF9pbnRlcnZlbnRpb25zX2VuYWJsZWQiOnsiYnVja2V0Ijoib24iLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X21peGVkX21lZGlhXzE1ODk3Ijp7ImJ1Y2tldCI6InRyZWF0bWVudCIsInZlcnNpb24iOm51bGx9LCJ0ZndfZXhwZXJpbWVudHNfY29va2llX2V4cGlyYXRpb24iOnsiYnVja2V0IjoxMjA5NjAwLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X3Nob3dfYmlyZHdhdGNoX3Bpdm90c19lbmFibGVkIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19kdXBsaWNhdGVfc2NyaWJlc190b19zZXR0aW5ncyI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdXNlX3Byb2ZpbGVfaW1hZ2Vfc2hhcGVfZW5hYmxlZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdmlkZW9faGxzX2R5bmFtaWNfbWFuaWZlc3RzXzE1MDgyIjp7ImJ1Y2tldCI6InRydWVfYml0cmF0ZSIsInZlcnNpb24iOm51bGx9LCJ0ZndfbGVnYWN5X3RpbWVsaW5lX3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9mcm9udGVuZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9fQ%3D%3D&amp;frame=false&amp;hideCard=false&amp;hideThread=false&amp;id=1672920942064943105&amp;lang=en&amp;origin=https%3A%2F%2Fgamerant.com%2Ffinal-fantasy-16-motion-blur-turn-off-sick-nausea%2F&amp;sessionId=501a4c3d92987422ae78ffef3121fcb6c766848a&amp;siteScreenName=gamerant&amp;theme=light&amp;widgetsVersion=aaf4084522e3a%3A1674595607486&amp;width=550px' data-tweet-id='1672920942064943105'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "rockstar games"
          }
        ]
      },
      {
        "author": {
          "name": "DEREK NICHOLS",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Mortal Kombat 1 Bringing Back Feature That Started in MKX",
        "subTitle": "The Mortal Kombat 1 stress test reveals a returning fan favorite online feature that was originally introduced back in 2015 with MKX.",
        "acticle": [
          "During the recent <strong><em>Mortal Kombat 1</em></strong> stress test, players were able to put the game through its paces and discover some previously unannounced features like the Quitality. After months of speculation with many fans assuming the next game from NetherRealm Studio would be <em>Mortal Kombat 12</em>, Ed Boon and the development team surprised just about everyone by introducing a rebooted franchise with Mortal Kombat 1.",
          "In this new timeline, Fire God Liu Kang has reshaped the world and everyone in it, sometimes for the more surprising as classic rivals Sub-Zero and Scorpion are now brothers. Alongside a brand-new story, <em>Mortal Kombat 1</em> features plenty of new mechanics such as Kameo fighters that can be called upon during a match to assist the player with throws, counters, combo extenders, and even Fatalities. However, players have also begun discovering previously unannounced features that are making a comeback as well.",
          "The first stress test for <a href='https://gamerant.com/tag/mortal-kombat-1/'>Mortal Kombat 1</a> gave many players their first opportunity to go hands on with the game, exploring the limited roster of characters and Kameo fighters. It also gave players the chance to mess around with the various '-ality' systems in the game such as the iconic fatality moves to put a fluorish on a match victory. However, players also began to discover that the Quitality mechanic has also returned for this latest iteration.",
          "Originally introduced in 2015's <em>Mortal Kombat X</em>, Quitalities result during online Mortal Kombat matches when one player decides to leave mid-match. Not only does the other player get the victory, but their opponent's character explodes to some degree suddenly to cap of the match. Players, like FGC community member Ketchup, have been discovering all of the new gory animations added to <em>Mortal Kombat 1</em> as players exit matches before the end of the round.",
          "Even as the first <em>Mortal Kombat 1</em> comes to a close, it appears to have been a big success for NetherRealm Studios with a high demand from fans. In fact, it was in such high demand, that it even caught the attention of scalpers who posted <em>MK1</em> stress test access keys online for ridiculous prices. On sites like eBay, codes were being sold for a variety of prices ranging from $180 to over $800."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/mortal-kombat-1-quitality.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 400,
        "images" : [],
        "externalData":"<iframe id='twitter-widget-0' scrolling='no' frameborder='0' allowtransparency='true' allowfullscreen='true' class='' style='position: static; visibility: visible; width: 550px; height: 321px; display: block; flex-grow: 1;' title='Twitter Tweet' src='https://platform.twitter.com/embed/Tweet.html?dnt=false&embedId=twitter-widget-0&features=eyJ0ZndfdGltZWxpbmVfbGlzdCI6eyJidWNrZXQiOltdLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X2ZvbGxvd2VyX2NvdW50X3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9iYWNrZW5kIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19yZWZzcmNfc2Vzc2lvbiI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfZm9zbnJfc29mdF9pbnRlcnZlbnRpb25zX2VuYWJsZWQiOnsiYnVja2V0Ijoib24iLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X21peGVkX21lZGlhXzE1ODk3Ijp7ImJ1Y2tldCI6InRyZWF0bWVudCIsInZlcnNpb24iOm51bGx9LCJ0ZndfZXhwZXJpbWVudHNfY29va2llX2V4cGlyYXRpb24iOnsiYnVja2V0IjoxMjA5NjAwLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X3Nob3dfYmlyZHdhdGNoX3Bpdm90c19lbmFibGVkIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19kdXBsaWNhdGVfc2NyaWJlc190b19zZXR0aW5ncyI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdXNlX3Byb2ZpbGVfaW1hZ2Vfc2hhcGVfZW5hYmxlZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdmlkZW9faGxzX2R5bmFtaWNfbWFuaWZlc3RzXzE1MDgyIjp7ImJ1Y2tldCI6InRydWVfYml0cmF0ZSIsInZlcnNpb24iOm51bGx9LCJ0ZndfbGVnYWN5X3RpbWVsaW5lX3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9mcm9udGVuZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9fQ%3D%3D&frame=false&hideCard=false&hideThread=false&id=1672274303587319810&lang=en&origin=https%3A%2F%2Fgamerant.com%2Fmortal-kombat-1-quitality-mkx%2F&sessionId=9a65ac727ad1e35d1ad1b4f95c9678a5786e6884&siteScreenName=gamerant&theme=light&widgetsVersion=aaf4084522e3a%3A1674595607486&width=550px' data-tweet-id='1672274303587319810'></iframe>",
        "tags": [
          {
            "name": "netherrealm studios"
          },
          {
            "name": "mortal kombat"
          },
          {
            "name": "mortal kombat x"
          },
          {
            "name": "mortal kombat 1"
          },
          {
            "name": "warner bros. interactive"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps5"
          },
          {
            "name": "xbox series x"
          },
          {
            "name": "xbox series s"
          },
          {
            "name": "switch"
          }
        ]
      },
      {
        "author": {
          "name": "DOMINIK BOŠNJAK",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Resident Evil 4 Update Hints at Imminent DLC Release",
        "subTitle": "A newly emerged Resident Evil 4 update hints at an imminent release of DLC for Capcom's hit survival horror remake.",
        "acticle": [
          "A new piece of DLC for <strong><em>Resident Evil 4</em></strong> could be releasing in the immediate future, as suggested by a newly emerged update to the Steam version of the game. While Capcom has yet to confirm it intends to put out more post-launch content for the hit remake, some recently datamined Resident Evil 4 files have already pointed to the return of Separate Ways, a fan-favorite story mode.",
          "Two weeks into its release, the Resident Evil 4 remake received its first free DLC in the form of the Mercenaries mode. The move left Separate Ways as the only major piece of content from the 2005 original that's still missing from the 2023 remake.",
          "And while the Japanese developer hasn't yet confirmed that Separate Ways is actually on its way to the game, the Steam version of <em>Resident Evil 4</em> has just been updated with seven new achievements, indicating that a major content drop is on the horizon. Five of the newly added trophies are hidden, while the remaining two have placeholder names that don't reveal anything about their prerequisites or the game itself. Seeing how Separate Ways added an extensive campaign starring Ada Wong to the original game, a new version of this lengthy mode could easily account for such a significant increase in the total number of the <em>Resident Evil 4</em> remake's achievements, which now stands at 46.",
          "This development dovetails with a recent Resident Evil 4 leak narrowing down the release date of the Separate Ways DLC, which suggested that the much-rumored addition will at the very least be revealed—if not released—in the second half of 2023. And while that's looking extremely plausible following this update to the game's list of achievements, what's still unclear is whether Capcom intends to charge fans for the privilege of experiencing the story of <em>Resident Evil 4 </em>from Ada Wong's perspective.",
          "Although the Mercenaries mode was released for free, the scope of Separate Ways is much closer to the likes of the Winters' Expansion for <em>Resident Evil Village</em> and <em>Resident Evil 7</em>'s End of Zoe, both of which released as paid DLC. Meanwhile, Capcom's previous two <em>Resident Evil</em> remakes didn't receive extensive post-launch support that would offer direct points of comparison; they both featured paid cosmetics, but so does <em>Resident Evil 4</em>, and such content isn't comparable to an ambitious expansion that would boost its respective game's number of achievements by 20%.",
          "It's hence possible that Capcom will opt to release Separate Ways as paid DLC. And while the expansion's business model is still unclear, what's certain is that Separate Ways will offer an entirely new perspective on the events of the <a href='https://gamerant.com/tag/resident-evil-4-remake/'><em>Resident Evil 4 remake</em></a>."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/resident-evil-4-remake-ada-wong-next-to-leon-composite.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 421,
        "images" : [],
        "externalData":"<iframe id='twitter-widget-0' scrolling='no' frameborder='0' allowtransparency='true' allowfullscreen='true' class='' style='position: static; visibility: visible; width: 550px; height: 321px; display: block; flex-grow: 1;' title='Twitter Tweet' src='https://platform.twitter.com/embed/Tweet.html?creatorScreenName=dddominikk&dnt=false&embedId=twitter-widget-0&features=eyJ0ZndfdGltZWxpbmVfbGlzdCI6eyJidWNrZXQiOltdLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X2ZvbGxvd2VyX2NvdW50X3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9iYWNrZW5kIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19yZWZzcmNfc2Vzc2lvbiI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfZm9zbnJfc29mdF9pbnRlcnZlbnRpb25zX2VuYWJsZWQiOnsiYnVja2V0Ijoib24iLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X21peGVkX21lZGlhXzE1ODk3Ijp7ImJ1Y2tldCI6InRyZWF0bWVudCIsInZlcnNpb24iOm51bGx9LCJ0ZndfZXhwZXJpbWVudHNfY29va2llX2V4cGlyYXRpb24iOnsiYnVja2V0IjoxMjA5NjAwLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X3Nob3dfYmlyZHdhdGNoX3Bpdm90c19lbmFibGVkIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19kdXBsaWNhdGVfc2NyaWJlc190b19zZXR0aW5ncyI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdXNlX3Byb2ZpbGVfaW1hZ2Vfc2hhcGVfZW5hYmxlZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdmlkZW9faGxzX2R5bmFtaWNfbWFuaWZlc3RzXzE1MDgyIjp7ImJ1Y2tldCI6InRydWVfYml0cmF0ZSIsInZlcnNpb24iOm51bGx9LCJ0ZndfbGVnYWN5X3RpbWVsaW5lX3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9mcm9udGVuZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9fQ%3D%3D&frame=false&hideCard=false&hideThread=false&id=1673313955245359105&lang=en&origin=https%3A%2F%2Fgamerant.com%2Fresident-evil-4-remake-dlc-release-separate-ways%2F&sessionId=d2c446e801797e1f5a2622531796cb1fc26ca099&siteScreenName=gamerant&theme=light&widgetsVersion=aaf4084522e3a%3A1674595607486&width=550px' data-tweet-id='1672274303587319810'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "resident evil"
          },
          {
            "name": "resident evil 4(2023)"
          },
          {
            "name": "capcom"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps4"
          },
          {
            "name": "ps5"
          },
          {
            "name": "xbox series x"
          },
          {
            "name": "steam"
          },
          {
            "name": "resident evil 4"
          }
        ]
      },
      {
        "author": {
          "name": "LAUREN BEELER-BEISTAD",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "MultiVersus Has Shut Down, But It Will Be Back",
        "subTitle": "The open beta for MultiVersus is officially over, but fans of the platform fighter still have the game's future to look forward to.",
        "acticle": [
          "The open beta for <strong><em>MultiVersus</em></strong> has officially shut down, but this isn't the end for the platform fighter. Warner Bros. Interactive's dive into the fighting genre has experienced an extensive open beta period, but the official closing of <em>MultiVersus</em>' beta signals a new chapter for the game.",
          "Released back in 2022, <em>MultiVersus</em> followed the path of <em>Super Smash Bros</em>. by pitting iconic Warner Bros. characters against one another in fun platform-based fighting matches. Although the game launched to a positive start, the player count for Multiversus dwindled since its release. With the falling player count, it seemed that the open beta had served its initial purpose of giving players a sneak peek. This decrease in interaction from fans was eventually followed by an announcement back in March that the open beta would be closing on June 25th. Despite the beta closing its doors, there is a still a future for <em>MultiVersus</em> that fans of the brawler title can look forward to.",
          "<em>MultiVersus</em> is set to return sometime in the first half of 2024, leaving some players eagerly waiting its eventual return. The game featured Warner Bros. characters ranging from Batman to Jake and Finn from <em>Adventure Time</em>, and the game's downtime will likely see developers fine-tuning both characters and combat in order to give players a great brawling experience when < href='https://gamerant.com/tag/multiversus/'><em>MultiVersus</em></> returns. Although it may frustrate some players that there isn't an official date for the game's 2024 launch, there are still ways fans will be able to enjoy the game.",
          "Those who have installed the game can still fight in local matches and use the training room, but all the online content will no longer be available. There are some who fear that this beta closure could be a bad move for <em>MultiVersus</em>, but all hope is not lost for the game. This beta closure could actually rile up excitement again. Absence sometimes makes the heart grow fonder, so it could possibly help the game's 2024 relaunch.",
          "Whether this beta closure helps the game's future or not, only time will tell. The positive response from many who played the beta during its initial release proves that the game has something to offer a specific audience. Until the game relaunches, there are alternatives to <em>MultiVersus</em> while it's on hiatus, and those titles could help inspire gamers to have a renewed sense of excitement for the game's relaunch. The future of <em>MultiVersus</em> is filled with unknowns, but a potential strong comeback in 2024 could give gamers a new favorite brawler to play."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/resident-evil-4-remake-ada-wong-next-to-leon-composite.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 80,
        "images" : ["https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/multiversus_closed_beta_relaunch_2024.jpeg"],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "multiversus"
          },
          {
            "name": "warner bros. interactive"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps4"
          },
          {
            "name": "ps5"
          },
          {
            "name": "xbox one"
          },
          {
            "name": "xbox series x"
          },
          {
            "name": "xbox"
          },
          {
            "name": "playstation"
          }
        ]
      },
      {
        "author": {
          "name": "GABRIEL MACHADO PUREZA",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Zelda: Tears of the Kingdom Scale Reveals Bizarre Detail About Link's Weight",
        "subTitle": "A clever Zelda: Tears of the Kingdom player creates a working scale and discovers how heavy the protagonist Link actually is.",
        "acticle": [
          "A resourceful <strong><em>Zelda: Tears of the Kingdom</em></strong> gamer has managed to create a working scale to measure Link’s weight. <em>Tears of the Kingdom</em> players are constantly inventing gadgets using the game’s extensive building systems, and this scale is definitely among the most creative ones so far.",
          "Ever since its release back in May, <em>Tears of the Kingdom</em> has been a huge hit. The game was able to sell over 10 million units in the first three days, and it continued to maintain its popularity as weeks passed. Part of why gamers love the new <em>Zelda</em> so much is due to how big and packed with interesting content the open world is. Often, this can lead to some pretty interesting interactions, especially when using the new Fuse and Ultrahand abilities, which are at the heart of the game’s building system.",
          "Now, a <a href='https://gamerant.com/tag/tears-of-the-kingdom/'><em>Tears of the Kingdom</em></a> gamer was able to invent a working scale. RecommendationOk6842 recently shared a video showing their latest creation: a scale that could be used to weigh several objects in the game or even the protagonist Link himself. The device was quite simple, using real-life principles that would apply to a scale, such as having two platforms that would be weighed against each other and using gravity to do the rest of the work. Hilariously, when the gamer weighed Link, they discovered that Hyrule’s hero was just as heavy as five apples. So, either Link is very light, or the apples in the game are incredibly heavy.",
          "People in the comments of the Reddit post were already finding some cool ways to employ this scale. For instance, Doubting_Gamer had the idea of using the object to measure the lightest items which could be used to build flying devices in <em>Tears of the Kingdom</em>. However, the game is still lacking an official measurement unit, so players were already discussing whether the official unit should be measured in apples or bananas, for instance.",
          "<em>Tears of the Kingdom</em> gamers continue to express their creativity and resourcefulness in many ways with Nintendo’s latest hit, and there are many other interesting examples of that. For instance, one <em>Zelda</em> player created a working lawnmower recently, completely automating the task of cutting grass. While the invention still needed a few tweaks to be perfect, it was a fine example of how creative players can be in Nintendo’s latest title."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/zelda-builds-working-scale.jpeg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 300,
        "images" : [],
        "externalData": "<iframe height='500' src='https://embed.reddit.com/r/HyruleEngineering/comments/14i5v1p/working_scale_guess_links_weight/?embed=true&amp;ref_source=embed&amp;ref=share&amp;utm_medium=widgets&amp;utm_source=embedv2&amp;utm_term=23&amp;utm_name=post_embed&amp;embed_host_url=https%3A%2F%2Fgamerant.com%2Fzelda-tears-of-the-kingdom-scale-link-weighs-how-much%2F' width='640px' scrolling='no' allowfullscreen='true' sandbox='allow-scripts allow-same-origin allow-popups' style='border: none; max-width: 100%; border-radius: 8px; display: block; margin: 0px auto;'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "the legend of zelda: tears of the kingdom"
          },
          {
            "name": "nintendo"
          },
          {
            "name": "switch"
          },
          {
            "name": "the legend of zelda"
          }
        ]
      },
      {
        "author": {
          "name": "DALTON COOPER",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "id": "diablo-4-reveals-how-to-unlock-the-title",
        "title": "Diablo 4 Reveals How to Unlock 'The' Title",
        "subTitle": "Blizzard explains how Diablo 4 players can unlock 'The' title for their various characters in the hit action-RPG.",
        "acticle": [
          "<strong><em>Diablo 4</em></strong> players wanting to unlock 'The' title in the hit action-RPG will need to complete all the side quests for the Bear Tribe in Fractured Peaks, as confirmed by Blizzard's Rod Fergusson. <a href='https://gamerant.com/tag/diablo-4/'><em>Diablo 4</em></a> gives players a variety of ways in which they can customize their characters. Besides naming their characters and outfitting them with various gear and cosmetics, players can also select from a variety of titles to give their <em>Diablo 4</em> character extra flair.",
          "<em>Diablo 4</em> titles can be seen by everyone in the game world, and since some titles are rather difficult to obtain, they give players a way to brag about their accomplishments to others. Some <em>Diablo 4</em> titles are sought out by the community, with many fans wanting to add 'The' to their list of available titles. Since titles are made up of a Prefix and Suffix, it makes sense that many <em>Diablo 4</em> players want 'The' as part of their title roster.",
          "Blizzard's Rod Fergusson acknowledged that many <em>Diablo 4</em> players are looking to add 'The' to their title choices, and so he revealed that it's unlocked by completing all the Bear Tribe side quests in Fractured Peaks. These side quests are found in Bear Tribe Refuge, which is an area players will likely visit fairly early in their <em>Diablo 4</em> adventures. Upon completing all the side quests, players will unlock two titles: 'The' and 'Bear.'",
          "The last side quest <em>Diablo 4</em> players will have to complete at Bear Tribe Refuge is called 'Call of the Ancients,'' and there is a glitch associated with it that fans should be aware of if they're hoping to unlock the 'The' title. If one's co-op partner is dead when they down the boss at the end of the Call of the Ancients quest, the objective will get stuck and players will have to redo the quest from the start. This bug is avoided by making sure everyone is up and revived before killing the boss.",
          "It's possible Blizzard will fix this bug in a future update, but plans to that effect have not actually been announced at the time of this writing. <em>Diablo</em> fans do know that a sizable update is coming to the game between now and when Season 1 launches in mid-July that will make various adjustments and add quality of life improvements. Blizzard is planning to support <em>Diablo 4</em> for quite some time to come, so fans can look forward to many more updates in the months ahead."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/diablo-4-lilith-wings.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 500,
        "images" : [],
        "externalData": "<iframe id='twitter-widget-0' scrolling='no' frameborder='0' allowtransparency='true' allowfullscreen='true' class='' style='position: static; visibility: visible; width: 550px; height: 273px; display: block; flex-grow: 1;' title='Twitter Tweet' src='https://platform.twitter.com/embed/Tweet.html?dnt=false&amp;embedId=twitter-widget-0&amp;features=eyJ0ZndfdGltZWxpbmVfbGlzdCI6eyJidWNrZXQiOltdLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X2ZvbGxvd2VyX2NvdW50X3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9iYWNrZW5kIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19yZWZzcmNfc2Vzc2lvbiI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfZm9zbnJfc29mdF9pbnRlcnZlbnRpb25zX2VuYWJsZWQiOnsiYnVja2V0Ijoib24iLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X21peGVkX21lZGlhXzE1ODk3Ijp7ImJ1Y2tldCI6InRyZWF0bWVudCIsInZlcnNpb24iOm51bGx9LCJ0ZndfZXhwZXJpbWVudHNfY29va2llX2V4cGlyYXRpb24iOnsiYnVja2V0IjoxMjA5NjAwLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X3Nob3dfYmlyZHdhdGNoX3Bpdm90c19lbmFibGVkIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19kdXBsaWNhdGVfc2NyaWJlc190b19zZXR0aW5ncyI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdXNlX3Byb2ZpbGVfaW1hZ2Vfc2hhcGVfZW5hYmxlZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdmlkZW9faGxzX2R5bmFtaWNfbWFuaWZlc3RzXzE1MDgyIjp7ImJ1Y2tldCI6InRydWVfYml0cmF0ZSIsInZlcnNpb24iOm51bGx9LCJ0ZndfbGVnYWN5X3RpbWVsaW5lX3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9mcm9udGVuZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9fQ%3D%3D&amp;frame=false&amp;hideCard=false&amp;hideThread=false&amp;id=1673101236810162179&amp;lang=en&amp;origin=https%3A%2F%2Fgamerant.com%2Fdiablo-4-the-title-unlock-how%2F&amp;sessionId=81e8a4f57ea6a0f067f4f834632309f87e4974ee&amp;siteScreenName=gamerant&amp;theme=light&amp;widgetsVersion=aaf4084522e3a%3A1674595607486&amp;width=550px' data-tweet-id='1673101236810162179'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "diablo 4"
          },
          {
            "name": "blizzard"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps4"
          },
          {
            "name": "ps5"
          },
          {
            "name": "xbox one"
          },
          {
            "name": "xbox series x"
          },
          {
            "name": "xbox"
          }
        ]
      },
      {
        "author": {
          "name": "LUIS PRADA",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Diablo 4 Player Makes Elden Ring's Starscourge Radahn in the Game",
        "subTitle": "A Diablo 4 player shares pictures of their version of Starscourge Radahn from Elden Ring made using Diablo 4's transmog system.",
        "acticle": [
          "A <strong><em>Diablo 4</em></strong> Player has used the game’s transmog system to create <em>Elden Ring</em>’s Starscourage Radahn in the game. <em>Diablo 4</em> was eagerly anticipated and did not disappoint after its recent release. The open-world RPG allows players to customize their characters to their liking. One of the ways <em>Diablo 4</em> gives players ultimate control over the style of their characters is with a transmog system.",
          "<em>Diablo 4</em>'s transmog system allows players to retain the stats of a particular piece of armor without having to wear that specific piece. It’s an option included in many RPGs that allows fashion-conscious players to customize their character’s looks as they see fit without sacrificing function. In essence, if a particular piece of armor looks good on the player’s character, but a different set has better stats, the player can use the stats of the better set while wearing the better-looking one.",
          "A <em>Diablo 4</em> fan named Broken_Mau23 in the game’s subreddit used the transmog system to deck out their character in an armor set that closely resembles the set worn by Starscourge Radahn from <em>Elden Ring</em>. Radahn’s armor set is comprised of ornate yet tarnished silver and gold plates trimmed with fur. The color of the metals is offset by the blood-red mane of hair streaming off the top of his helmet. Broken_Mau23 found a suitable stand-in for the iconic helmet with <em>Diablo 4</em>’s Zischagge helm. While Radanh’s chest piece is perhaps a bit too ornate for what <em>Diablo 4</em> has to offer, Broken_Mau23 used the Warlord Plate, which comes with bulky decorative shoulder pads that come close to mimicking Radahn’s more extravagant armor.",
          "For the legs, the crafty <em>Diablo 4</em> player used Strider’s Handwraps. While not quite like Radahn’s silver and gold gauntlets, the handwraps are of a similar enough color and tone. For the legs, they used the Sand-Worn Breeches, which are perhaps the piece of armor in <em>Diablo 4</em> that most closely resembles Radahn’s armor.",
          "Radahn was one of the most fearsome and difficult bosses in <em>Elden Ring</em> before he was nerfed in an early patch to make him less difficult. Still, his visual style is an aspect that fans latched onto. One piece of Radahn iconography that is missing, however, is the same piece that made a lot of fans fall in love with him: his horse, Leonard. Radahn’s uses his powers of levitation to stay atop his beloved yet undersized horse without crushing it. While <em>Diablo 4</em> does have horses and even horse armor, it is unlikely that Blizzard will include a tiny, scrawny horse like Leonard anytime soon."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/diablo-4-player-makes-elden-ring-starscourge-radahn-in-game-gamerant-1.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 280,
        "images" : [],
        "externalData": "<iframe height='500' src='https://embed.reddit.com/r/diablo4/comments/14jl3h6/starscourge_radahn_elden_ring_inspired_transmog/?embed=true&amp;ref_source=embed&amp;ref=share&amp;utm_medium=widgets&amp;utm_source=embedv2&amp;utm_term=23&amp;utm_name=post_embed&amp;embed_host_url=https%3A%2F%2Fgamerant.com%2Fdiablo-4-starscourge-radahn-elden-ring-custom-character%2F' width='640px' scrolling='no' allowfullscreen='true' sandbox='allow-scripts allow-same-origin allow-popups' style='border: none; max-width: 100%; border-radius: 8px; display: block; margin: 0px auto;'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "diablo 4"
          },
          {
            "name": "blizzard"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps4"
          },
          {
            "name": "ps5"
          },
          {
            "name": "xbox one"
          },
          {
            "name": "xbox series x"
          },
          {
            "name": "xbox"
          }
        ]
      },
      {
        "author": {
          "name": "PAM K FERDINAND",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Atomic Heart Reveals DLC Weapons, Robots, Setting, and More",
        "subTitle": "Mundfish finally shares details about the upcoming Atomic Heart DLC, including the new setting, release date, and showing off the new weapons.",
        "acticle": [
          "Developer Mundfish has finally revealed more details about the upcoming DLC for <strong><em>Atomic Heart</em></strong>, including a glimpse of some of the new things players can expect when it launches on August 2. <a href='https://gamerant.com/tag/atomic-heart/'><em>Atomic Heart</em></a> seemed to be one of those games that people either loved or hated when it launched in February 2023, and its mixed reviews reflected this.",
          "In addition to the controversies surrounding the game’s setting and some of its content, the single-player first-person shooter also shipped with a lot of bugs that hampered gameplay. Mundfish has since released regular updates to iron out many of the issues, while also teasing the upcoming <em>Atomic Heart</em> DLC, which up till now only had a release window.",
          "“Annihilation Instinct,” the long-awaited DLC for <em>Atomic Heart</em> will be launching on August 2, 2023, for all platforms. The story picks up where the events of <em>Atomic Heart</em> left off, and a new trailer and its description have revealed that there will be new shape-shifting enemies in the <em>Atomic Heart</em> DLC for protagonist P-3 to take on. Players will also venture into the swamps surrounding a new location, the Mendeleev Complex, which is apparently still part of Facility 3826, where the main game takes place.",
          "Additionally, Annihilation Instinct will introduce two new weapons to <em>Atomic Heart</em>: the Secateur, which looks like a kind of energy rifle of a size similar to the Dominator, and the Klusha, which resembles a two-handed polearm-type melee weapon. P-3 also still has his glove and will gain a new Techno-Stasis ability that allows him to manipulate time.",
          "This new glove power complements the theme of the Annihilation Instinct DLC, which seems to center around uncovering the truth about NORA, the talkative vending machine that’s used to upgrade weapons and unlock new skills in <em>Atomic Heart</em>. The DLC will also bring back NPCs from the main game and introduce a new “enigmatic” character.",
          "For those who enjoy the game and don’t think a DLC will be enough, Mundfish recently released a New Game+ mode with Update 1.8.0.0, which gives enemies new abilities to watch out for. For example, the VOV-A6 Lab Tech, the mustachioed robot, will be immune to glove abilities and cartridge weapons while also enjoying increased attack and movement speeds. The developer has revealed that an <em>Atomic Heart</em> sequel is already in the works as well, though further details about that project may be a long time coming."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/resident-evil-4-remake-ada-wong-next-to-leon-composite.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 220,
        "images" : [],
        "externalData": "<iframe allow='accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture' allowfullscreen='' frameborder='0' height='315' src='https://www.youtube.com/embed/q1SOohjUWd8' width='560'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "atomic heart"
          },
          {
            "name": "focus home interactive"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps4"
          },
          {
            "name": "ps5"
          },
          {
            "name": "xbox one"
          },
          {
            "name": "xbox series x"
          }
        ]
      },
      {
        "author": {
          "name": "KEVIN JAMES BILLINGS",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Bungie's Next IP After Destiny and Marathon Has a Potential Release Window",
        "subTitle": "It appears Bungie's third new IP, known only as Matter, may not be as far off as players may think according to new documents.",
        "acticle": [
          "<strong>Bungie</strong> is already hard at work with the ongoing support of <em>Destiny 2</em> and upcoming reboot of <em>Marathon</em>, but it appears the studio's third new IP may not be as far as some players may be thinking if a new report is correct. News on the third IP, known only as Matter following a 2018 trademark filing, has been fairly light in 2023 as the studio focuses on its two known titles. However, this new information does not come directly from <a href='https://gamerant.com/tag/bungie/'>Bungie</a>, but instead from the current legal litigation embroiling Microsoft's proposal to acquire Activision Blizzard.",
          "Destiny 2's current season, Season of the Deep, sees the return of Titan to the Sol System after its disappearance at the launch of 2020's <em>Beyond Light</em> expansion. Guardians have been summoned to the moon at the request of Deputy Commander Sloane, who is requesting aid to protect a creature living beneath the methane waves which may have valuable information about The Witness. However, the Hive god Xivu Arath is also making her presence in the system known more directly as her forces work to stop Sloane's plans for the creature.",
          "Despite the near constant support required for <em>Destiny 2</em> and development of the new <em>Marathon</em>, new documents from Microsoft's FTC hearings suggest <em>Matter</em> could be releasing sometime in 2025. The hearing documents specifically contain an evaluation of Bungie done by Microsoft in 2021, outlining some of the studio's plans at the time for expansion and game support. It points out how the studio 'has more than doubled its headquarter space' and was set to open its first international office in Amsterdam in 2022, the latter of which would focus on <em>Destiny 2</em> support and development of <em>Matter</em>.",
          "The internal evaluation by Microsoft lines up with additional reports suggesting the tech giant was interested in acquiring Bungie, along with Sega, in 2020. By that time, the studio was known to be working on a new IP, <em>Matter</em>, and had received a $100 million investment Chinese tech company NetEase to go toward the new project. Updates became few and far between following this news, though it has been confirmed the <em>Marathon</em> reboot is an entirely different project from the third IP.",
          "Since the time of the evaluation, Bungie has seen quite a few changes occur on the business side as the studio is no longer independent. Sony completed its acquisition of the studio for roughly $3.6 billion in July 2022, joining a roster of first-party studios which include Sucker Punch and Insomniac. It also remains to be seen if the 2025 release window in the 2021 evaluation remains accurate, or if the new IP may be further off than players think."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/bungie-microsoft-matter-release-window.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 208,
        "images" : ["https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/05/marathon_trailer.jpg?q=50&fit=crop&w=1500&dpr=1.5"],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "bungie"
          },
          {
            "name": "destiny"
          },
          {
            "name": "destiny 2"
          },
          {
            "name": "xbox"
          },
          {
            "name": "microsoft"
          }
        ]
      },
      {
        "author": {
          "name": "MARC KEEVER",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Alan Wake 2 Dev Defends Digital-Only Release",
        "subTitle": "A member of the Alan Wake 2 development team has spoken out in defense of the game's fast approaching digital-only release later this year.",
        "acticle": [
          "Some fans are disappointed that there will not be a physical release for <strong><em>Alan Wake 2</em></strong>, and the developer has now revealed the logic behind the decision. There has been some discourse around digital-only releases for AAA games like <em>Alan Wake 2</em>, with many fans being concerned by what appears to be a growing trend with big-league developers.",
          "Some of the main concerns around digital-only releases are well-established. Somewhat ironically, the original <em>Alan Wake</em> was pulled from digital storefronts for over a year due to music licensing issues. While it was eventually made available once everything was ironed out, the fact remains that nobody could buy <em>Alan Wake</em> for 17 months. Game collectors and preservationists are generally outspoken about the importance of physical releases; there is always a possibility that a digital storefront will be closed at some point, and physical releases are a way of ensuring that a game is available to play if this ever happens.",
          "Kyle Rowley, the game director for <a href='https://gamerant.com/tag/alan-wake-2/'><em>Alan Wake 2</em></a>, has defended the digital-only release of the game. In an interview with Eurogamer, Rowley explains that taking the digital-only release route allows the team 'more time to polish the game' and explains that the game that goes on a physical release would need to be playable without a patch several weeks ahead of launch. This is termed 'going gold', which refers to a version of a game (the 'gold master' version) that the publisher deems complete and ready to ship. By skipping out on this step and going with a digital-only release, Remedy can essentially keep working on <em>Alan Wake 2</em> until the day it launches.",
          "There are a few ways fans of <em>Alan Wake</em> can look at this news. The first one is in the light of optimism; it certainly would be remiss if <em>Alan Wake 2</em> was immortalized on a physical medium in an unplayable state, and it would also be in poor taste to ship a physical copy of the game that is little more than a DRM key on a disc. Remedy has done well to temper fans' expectations, but Rowley's words might exacerbate some concerns about <em>Alan Wake 2</em> after its Summer Game Fest trailer was a little light on gameplay.",
          "It could be that digital-only releases are becoming a third option for developers who are deciding between releasing a game that they don't feel is ready or delaying it. That said, the developers of <em>Alan Wake 2</em> have spoken confidently about their work in the context of its October release, with the month typically being saturated with exciting horror releases in the build-up to Halloween."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/alan-wake-2-dev-defends-digital-only-release.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 260,
        "images" : ["https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/alan-wake-2-image-4.jpg?q=50&fit=crop&w=1500&dpr=1.5"],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "alan wake 2"
          },
          {
            "name": "remedy entertainment"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "xbox series x"
          },
          {
            "name": "ps5"
          },
          {
            "name": "playstation"
          },
          {
            "name": "xbox"
          }
        ]
      },
      {
        "author": {
          "name": "ERIC LAW",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Dungeons and Dragons Reveals Biggest One D&D Playtest Yet",
        "subTitle": "Dungeons and Dragons shares the biggest Unearthed Arcana in history, including changes to seven classes, revised spells and feats, and new subclasses.",
        "acticle": [
          "<strong><em>Dungeons and Dragons</em></strong> just released its biggest Unearthed Arcana playtest packet in its long history. This massive document includes revisions for multiple classes, subclasses, spells, feats, and other <a href='https://gamerant.com/tag/dungeons-and-dragons/'><em>Dungeons and Dragons</em></a> rules.",
          "Wizards of the Coast is in the process of revising <em>5th Edition Dungeons and Dragons</em> to become an evergreen system. This initiative, called <em>One D&D</em>, has involved rigorous playtesting via Unearthed Arcana documents full of revised rules and new content.",
          "Its most recent Unearthed Arcana packet is its biggest one yet. This 77-page document includes tons of revisions, many of which build upon previous playtests and surveys. Several spell lists, spells, and feats have received continued tweaks in an effort to improve the game, and Weapon Mastery from the last <em>Dungeons and Dragons</em> playtest has been refined and expanded to other classes. Additionally, seven full classes appear in the document, including Monk–the only one not published in an Unearthed Arcana yet.",
          "Here are some of the biggest changes each <em>Dungeons and Dragons</em> class received:",
          "<ul> <li> Bards can now use spell slots when they run out of Bardic Inspiration, have more freedom in what spells they learn, and have a powerful capstone ability called Words of Creation. </li> <li> Clerics now always have the Commune spell prepared, can deal damage with Turn Undead, and can cast the Wish spell using Greater Divine Intervention. </li> <li> Druid Wildshapes changes have been partially reverted, but all Druids can transform as a bonus action and can improve their Wildshape attacks or cantrips with Elemental Fury. </li> <li> Monk Martial Arts dice scale from a d6 to a d12, but only affect unarmed strikes. Additionally, several Monk abilities are renamed and reworked, and they have a new capstone called Defy Death. </li> <li> Paladins can now use Lay on Hands as a bonus action, and Divine Smite has been reworked into a series of Paladin-only spells. </li> <li> <a href='https://gamerant.com/dungeons-dragons-5e-best-ranger-builds/'>Rangers gain iconic <em>Dungeons and Dragons</em></a> spells like Hunter’s Mark and Conjure Barrage for free, and have an improved version of Foe Slayer as a final ability. </li> <li> Rogues can reduce their sneak attack damage to inflict conditions and maneuver around the battlefield with Cunning Strike and Devious Strikes. </li> </ul>",
          "Additionally, the two classes received two never-before-seen subclasses: the College of Dance Bard and the Circle of the Sea Druid. The College of Dance gives the Bard powerful support abilities reminiscent of a Monk, and the Circle of the Sea grants Druids abilities to navigate the skies and the oceans and to control the battlefield cold, lightning, and thunder damage. If these subclasses are printed, players can expect them in the revised <em>5th Edition Dungeons and Dragons Players Handbook</em> planned for 2024."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/dungeons-and-dragons-one-d-d-playtest.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 321,
        "images" : [],
        "externalData": "<iframe id='twitter-widget-0' scrolling='no' frameborder='0' allowtransparency='true' allowfullscreen='true' class='' style='position: static; visibility: visible; width: 504px; height: 604px; display: block; flex-grow: 1;' title='Twitter Tweet' src='https://platform.twitter.com/embed/Tweet.html?creatorScreenName=DarthDecisive&amp;dnt=false&amp;embedId=twitter-widget-0&amp;features=eyJ0ZndfdGltZWxpbmVfbGlzdCI6eyJidWNrZXQiOltdLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X2ZvbGxvd2VyX2NvdW50X3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9iYWNrZW5kIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19yZWZzcmNfc2Vzc2lvbiI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfZm9zbnJfc29mdF9pbnRlcnZlbnRpb25zX2VuYWJsZWQiOnsiYnVja2V0Ijoib24iLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X21peGVkX21lZGlhXzE1ODk3Ijp7ImJ1Y2tldCI6InRyZWF0bWVudCIsInZlcnNpb24iOm51bGx9LCJ0ZndfZXhwZXJpbWVudHNfY29va2llX2V4cGlyYXRpb24iOnsiYnVja2V0IjoxMjA5NjAwLCJ2ZXJzaW9uIjpudWxsfSwidGZ3X3Nob3dfYmlyZHdhdGNoX3Bpdm90c19lbmFibGVkIjp7ImJ1Y2tldCI6Im9uIiwidmVyc2lvbiI6bnVsbH0sInRmd19kdXBsaWNhdGVfc2NyaWJlc190b19zZXR0aW5ncyI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdXNlX3Byb2ZpbGVfaW1hZ2Vfc2hhcGVfZW5hYmxlZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9LCJ0ZndfdmlkZW9faGxzX2R5bmFtaWNfbWFuaWZlc3RzXzE1MDgyIjp7ImJ1Y2tldCI6InRydWVfYml0cmF0ZSIsInZlcnNpb24iOm51bGx9LCJ0ZndfbGVnYWN5X3RpbWVsaW5lX3N1bnNldCI6eyJidWNrZXQiOnRydWUsInZlcnNpb24iOm51bGx9LCJ0ZndfdHdlZXRfZWRpdF9mcm9udGVuZCI6eyJidWNrZXQiOiJvbiIsInZlcnNpb24iOm51bGx9fQ%3D%3D&amp;frame=false&amp;hideCard=false&amp;hideThread=false&amp;id=1674477837552693249&amp;lang=en&amp;origin=https%3A%2F%2Fgamerant.com%2Fdungeons-dragons-playtest-classes-monk-changes%2F&amp;sessionId=8f112eb09dd9908e20e295129dd752fd99246f8d&amp;siteScreenName=gamerant&amp;theme=light&amp;widgetsVersion=aaf4084522e3a%3A1674595607486&amp;width=550px' data-tweet-id='1674477837552693249'></iframe>",
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "dungeons and dragons"
          },
          {
            "name": "wizard of the coast"
          },
          {
            "name": "hasbro"
          }
        ]
      },
      {
        "author": {
          "name": "NEVILLE LAHIRU",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Steam Deck Gets Major Discount During Steam Summer Sale",
        "subTitle": "As part of its latest Steam Summer Sale, Valve is offering its popular handheld Steam Deck at discounted rates for the second time this year.",
        "acticle": [
          "Valve's <strong>Steam Deck</strong> is now on sale at a discounted rate as part of this year's Steam Summer Sale. The company's gaming hardware has been a hit among gamers since its debut last year, with many titles ranging from <em>Cyberpunk 2077</em> to Hi-Fi Rush supporting the Steam Deck. As its latest Steam sale kicks off, Valve is seemingly looking to capitalize on the Steam Deck's appeal.",
          "Of course, it's no surprise that the Steam Deck continues to be a popular choice among many gamers. Customers had to wait eight months to order the device without reservations thanks to challenges in meeting demands with sufficient supply. The Steam Deck reportedly crossed a million units around October 2022. By early March, Valve's internal research indicated that about 42% of Steam Deck owners prefer gaming on the device as compared to other platforms.",
          "Following this growing appeal, Valve has put up the <a href='https://gamerant.com/tag/steam-deck/'>Steam Deck</a> for sale alongside the slew of discounted games at the latest Steam Summer Sale. While Valve previously offered the Steam Deck on sale back in March, gamers rarely get the opportunity to get a hold of the handheld device at a discounted rate. This means interested buyers can now grab the 64GB base model at a 10% discount for $359.10 whereas the 256GB model ships 15% off at $449.65. Additionally, gamers can buy the 512GB Steam Deck for $519.20, which is $129.80 off its usual pricing. The cheaper offering will be available for purchase on the Steam Store from 29 June to 13 July.",
          "While the hardware's popularity continues, Valve is also actively investing in its software improvements. Recently, the company unveiled a notable visual overhaul to the Steam desktop client that affected its font, notifications, and download tab among other areas. Of course, the updated UI made its way to mobile and Steam Deck as well. Additionally, the changes included a refreshed in-game overlay for desktop users along with a new Notes feature that was previously available in a Steam beta client version.",
          "As of now, it remains to be seen if Valve will choose to offer the Steam Deck at discounted rates anytime soon following the Steam Summer Sale. Although, it's safe to assume the company may have plans for another Steam Deck sale during the year, particularly considering the slew of Steam sale events in 2023. Regardless, this would come as welcome news to PC gamers who have been considering a viable handheld option like the <strong>Steam Deck</strong>. As to how far its appeal carries through for Valve in the months, if not years to come, only time will tell."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/steam-deck-sale.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-18T06:00:00Z",
        "views": 423,
        "images" : ["https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/04/steam-deck-console.jpg?q=50&fit=crop&w=1500&dpr=1.5"],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "steam deck"
          },
          {
            "name": "steam"
          },
          {
            "name": "valve"
          }
        ]
      },
      {
        "author": {
          "name": "DANIEL MORRIS",
          "imageProfile": "", 
          "url": "https://www.theguardian.com/profile/helen-davidson"
        },
        "title": "Silent Hill 2 Remake Voice Actor Gives Release Date Hint",
        "subTitle": "The voice actor for James Sunderland, Luke Roberts, seems to drop a small hint online about the potential release date of the Silent Hill 2 remake.",
        "acticle": [
          "Voice actor Luke Roberts, who will play James Sunderland in the <strong><em>Silent Hill 2</em></strong> remake, has seemingly hinted at the long-awaited title's release date. Rumors indicate that the <em>Silent Hill 2 </em>remake is close to completion, but this hint indicates players have a small wait on their hands yet.",
          "It's been an incredible few years for fans of horror remakes. Capcom has had an enormous amount of success remaking its iconic <em>Resident Evil</em> franchise, with each title received brilliantly. The hope is that Konami and Bloober Team can recreate that same success with <a href='https://gamerant.com/tag/silent-hill/'>Silent Hill 2</a>. While the franchises are certainly different in many ways, there's no denying that there's a significant overlap in player base there. In many ways, Capcom has done the leg work by getting gamers excited about horror again, and teed up the ball for Bloober Team perfectly. Now all the studio has to do is hit <em>Silent Hill 2</em> out of the park.",
          "The news comes from the video game forum ResetEra, where a user allegedly direct messaged Roberts on Instagram asking when <em>Silent Hill 2</em> was set to be released. His response was a short but sweet 'Early next year I believe...' Just a few weeks ago, a release date of September 29 leaked for the <em>Silent Hill 2</em> remake, contradicting Roberts' message here. It should be said that this date came from an online website, where placeholder dates are often used in lieu of actual release dates. If the message from Luke Roberts is real, players should be inclined to believe him, as the actor for the game's protagonist should probably have some inkling of when it will release.",
          "Despite the date being later than many might have expected, it does make sense. Since the Silent Hill 2 remake was first announced with a trailer in October 2022, there has yet to be any official marketing for the game from Bloober Team. If it was to be released this year as many fans had speculated, a greater marketing push would probably have been expected by now. Of course, no two games are the same, and the developer could simply be taking a different approach, but a release this year is becoming increasingly unlikely.",
          "No matter when the game releases, it's just good to see <em>Silent Hill</em> rise from the dead. The last release in the series was <em>Silent Hill: Downpour</em>, which came all the way back in 2012. After nothing came of <em>P.T.</em> back in 2014, gamers could be forgiven for thinking <em>Silent Hill</em>'s hiatus was a permanent one. But with <em>Silent Hill F</em> on the way in the future too, it seems as though Konami is all in on <em>Silent Hill</em> once more."
        ],
        "imageLanding": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/silent-hill-2-remake-release-date.jpg?q=50&fit=contain&w=1140&h=&dpr=1.5",
        "date": "2020-03-21T06:00:00Z",
        "views": 423,
        "images" : ["https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/silent-hill-2-date.jpg?q=50&fit=crop&dpr=1.5"],
        "tags": [
          {
            "name": "games"
          },
          {
            "name": "silent hill"
          },
          {
            "name": "bloober team"
          },
          {
            "name": "konami"
          },
          {
            "name": "pc gaming"
          },
          {
            "name": "ps5"
          },
          {
            "name": "playstation"
          }
        ]
      }
    ]
  }
